taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KExx_DFP.1.7.0.pdsc
          <book name="Documents/MKE02Z64M20SF0RM.pdf" title="MKE02Z64xxx2 Device Reference Manual"/>
          <book name="Documents/MKE02P64M20SF0.pdf"   title="MKE02Z64xxx2 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z64xxx4  ****************************** -->
        <device Dname="MKE02Z64xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
          <compile header="Device/Include/MKE02Z4.h" define="MKE02Z64xxx4"/>
          <debug svd="SVD/MKE02Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P64KB.FLM"  start="0x00000000" size="0x00010000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/MKE02P64M40SF0RM.pdf" title="Kinetis KE02 Sub-Family Reference Manual"/>
          <book name="Documents/MKE02P64M40SF0.pdf"   title="Kinetis KE02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z32xxx4  ****************************** -->
        <device Dname="MKE02Z32xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
          <compile header="Device/Include/MKE02Z4.h" define="MKE02Z32xxx4"/>
          <debug svd="SVD/MKE02Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P32KB.FLM"  start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/MKE02P64M40SF0RM.pdf" title="Kinetis KE02 Sub-Family Reference Manual"/>
          <book name="Documents/MKE02P64M40SF0.pdf"   title="Kinetis KE02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z16xxx4  ****************************** -->
        <device Dname="MKE02Z16xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
          <compile header="Device/Include/MKE02Z4.h" define="MKE02Z16xxx4"/>
          <debug svd="SVD/MKE02Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P16KB.FLM"  start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>

          <book name="Documents/MKE02P64M40SF0RM.pdf" title="Kinetis KE02 Sub-Family Reference Manual"/>
          <book name="Documents/MKE02P64M40SF0.pdf"   title="Kinetis KE02 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KE04  ****************************** -->
      <subFamily DsubFamily="KE04">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KE04 MCU family delivers a next-generation solution with enhanced ESD/EMC performance for cost-sensitive, high-reliability device applications used in high electrical noise environments.
 - Offers a cost-effective 32-bit solution featuring low power and high robustness
 - Provides a pin-compatibility within the Kinetis E series portfolio, as well as pin compatibility with our 8-bit S08P family
 - Includes a powerful array of analog, communication and timing, and control peripherals with varying flash memory size and pin count
        </description>

        <!-- ******************************  MKE04Z8xxx4  ****************************** -->
        <device Dname="MKE04Z8xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE04Z4.h" define="MKE04Z8xxx4"/>
          <debug svd="SVD/MKE04Z4.svd"/>
          <memory id="IROM1"                         start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x1FFFFF00" size="0x00000400" init   ="0" default="1"/>
          <algorithm name="Flash/MKE04Zxxx_P8KB.FLM" start="0x00000000" size="0x00002000" RAMstart="0x1FFFFF00" RAMsize="0x400" default="1"/>

          <book name="Documents/MKE04P24M48SF0RM.pdf" title="Kinetis KE04 Sub-Family Reference Manual"/>
          <book name="Documents/MKE04P24M48SF0.pdf"   title="Kinetis KE04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE04Z64xxx4  ****************************** -->
        <device Dname="MKE04Z64xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE04Z1284.h" define="MKE04Z64xxx4"/>
          <debug svd="SVD/MKE04Z1284.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE04Zxxx_P64KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

