taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KExx_DFP.1.7.0.pdsc
  </conditions>

  <components>
    <!-- Startup KE02Z2 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE02Z2 CMSIS">
      <description>System Startup for Kinetis KE02 20MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE02Z2.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE02Z2.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE02Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE02Z4 CMSIS">
      <description>System Startup for Kinetis KE02 40MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE02Z4.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE02Z4.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE04Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE04Z4 CMSIS">
      <description>System Startup for Kinetis KE04 40MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE04Z4.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE04Z4.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE04Z1284 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE04Z1284 CMSIS">
      <description>System Startup for Kinetis KE04 40MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE04Z1284.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE04Z1284.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE06Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE06Z4 CMSIS">
      <description>System Startup for Kinetis KE04 40MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE06Z4.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE06Z4.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE14Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="KE14Z7 CMSIS">
      <description>System Startup for Kinetis KE14 72MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE14Z7.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE14Z7.c"      attr="config" version="3.0.0"/>
        <file category="header"  name="Device/Source/system_MKE14Z7.h"      attr="config" version="3.0.0"/>
      </files>
    </component>

    <!-- Startup KE15Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="KE15Z7 CMSIS">
      <description>System Startup for Kinetis KE15 72MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE15Z7.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE15Z7.c"      attr="config" version="3.0.0"/>
        <file category="header"  name="Device/Source/system_MKE15Z7.h"      attr="config" version="3.0.0"/>
      </files>
    </component>

    <!-- Startup KE14F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE14F16 CMSIS">
      <description>System Startup for Kinetis KE14F 160MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE14F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE14F16.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKE14F16.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE16F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE16F16 CMSIS">
      <description>System Startup for Kinetis KE16F 160MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE16F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE16F16.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKE16F16.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE18F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE18F16 CMSIS">
      <description>System Startup for Kinetis KE18F 160MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKE18F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKE18F16.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKE18F16.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <bundle Cbundle="TWR-KE18F" Cclass="Board Support" Cversion="1.0.0">
      <description>TWR-KE18F Board Support</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="KE18F16 CMSIS">
        <description>A/D Converter interface for NXP TWR-KE18F board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KE18F/Common/ADC_TWR-KE18F.c"/>
        </files>
      </component>
